In [55]:
import pandas as pd
import numpy as np

dataframe3 = pd.DataFrame(np.random.randn(25).reshape(5,5),index=['one','two','three','four','five'],columns=['1st','2nd','3rd','4th','5th'])
dataframe3

            1st       2nd       3rd       4th       5th
one    0.393611  0.761181 -0.767408  0.121520  1.258053
two   -1.070712 -1.186891 -0.625004  1.968217 -1.834055
three  0.621228 -1.384585  1.225896 -0.845472 -0.373426
four  -0.701910  0.011897  0.368380 -0.169892  0.330123
five  -1.226038 -0.181238  1.455589 -2.830806 -2.481992

In [56]:
#dataframe summary methods
dataframe3.describe()

            1st       2nd       3rd       4th       5th
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean  -0.396764 -0.395927  0.331491 -0.351286 -0.620259
std    0.850884  0.888028  1.023154  1.734127  1.535542
min   -1.226038 -1.384585 -0.767408 -2.830806 -2.481992
25%   -1.070712 -1.186891 -0.625004 -0.845472 -1.834055
50%   -0.701910 -0.181238  0.368380 -0.169892 -0.373426
75%    0.393611  0.011897  1.225896  0.121520  0.330123
max    0.621228  0.761181  1.455589  1.968217  1.258053

In [57]:
dataframe3.transpose()

          one       two     three      four      five
1st  0.393611 -1.070712  0.621228 -0.701910 -1.226038
2nd  0.761181 -1.186891 -1.384585  0.011897 -0.181238
3rd -0.767408 -0.625004  1.225896  0.368380  1.455589
4th  0.121520  1.968217 -0.845472 -0.169892 -2.830806
5th  1.258053 -1.834055 -0.373426  0.330123 -2.481992

In [58]:
dataframe3.transpose().describe()

            one       two     three      four      five
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.353391 -0.549689 -0.151272 -0.032280 -1.052897
std    0.757674  1.472465  1.066029  0.436222  1.752537
min   -0.767408 -1.834055 -1.384585 -0.701910 -2.830806
25%    0.121520 -1.186891 -0.845472 -0.169892 -2.481992
50%    0.393611 -1.070712 -0.373426  0.011897 -1.226038
75%    0.761181 -0.625004  0.621228  0.330123 -0.181238
max    1.258053  1.968217  1.225896  0.368380  1.455589

In [59]:
#other useful methods
dataframe3

            1st       2nd       3rd       4th       5th
one    0.393611  0.761181 -0.767408  0.121520  1.258053
two   -1.070712 -1.186891 -0.625004  1.968217 -1.834055
three  0.621228 -1.384585  1.225896 -0.845472 -0.373426
four  -0.701910  0.011897  0.368380 -0.169892  0.330123
five  -1.226038 -0.181238  1.455589 -2.830806 -2.481992

In [60]:
dataframe3.sum()

1st   -1.983820
2nd   -1.979637
3rd    1.657454
4th   -1.756431
5th   -3.101297
dtype: float64

In [61]:
dataframe3.sum(axis=1)

one      1.766957
two     -2.748444
three   -0.756358
four    -0.161402
five    -5.264484
dtype: float64

In [62]:
dataframe3.cumsum()

            1st       2nd       3rd       4th       5th
one    0.393611  0.761181 -0.767408  0.121520  1.258053
two   -0.677100 -0.425711 -1.392412  2.089738 -0.576002
three -0.055872 -1.810295 -0.166516  1.244266 -0.949428
four  -0.757782 -1.798399  0.201865  1.074374 -0.619305
five  -1.983820 -1.979637  1.657454 -1.756431 -3.101297

In [63]:
dataframe3.cumsum(axis=1)

            1st       2nd       3rd       4th       5th
one    0.393611  1.154792  0.387384  0.508904  1.766957
two   -1.070712 -2.257603 -2.882607 -0.914389 -2.748444
three  0.621228 -0.763357  0.462539 -0.382933 -0.756358
four  -0.701910 -0.690013 -0.321633 -0.491525 -0.161402
five  -1.226038 -1.407276  0.048314 -2.782492 -5.264484

In [64]:
dataframe3.min()

1st   -1.226038
2nd   -1.384585
3rd   -0.767408
4th   -2.830806
5th   -2.481992
dtype: float64

In [65]:
dataframe3.min(axis=1)

one     -0.767408
two     -1.834055
three   -1.384585
four    -0.701910
five    -2.830806
dtype: float64

In [66]:
dataframe3.max()

1st    0.621228
2nd    0.761181
3rd    1.455589
4th    1.968217
5th    1.258053
dtype: float64

In [67]:
dataframe3.max(axis=1)

one      1.258053
two      1.968217
three    1.225896
four     0.368380
five     1.455589
dtype: float64

In [68]:
dataframe3.idxmax()

1st    three
2nd      one
3rd     five
4th      two
5th      one
dtype: object

In [69]:
dataframe3.idxmin()

1st     five
2nd    three
3rd      one
4th     five
5th     five
dtype: object

In [70]:
dataframe3.idxmin(axis=1)

one      3rd
two      5th
three    2nd
four     1st
five     4th
dtype: object

In [71]:
dataframe3.idxmax(axis=1)

one      5th
two      4th
three    3rd
four     3rd
five     3rd
dtype: object

### creating dataframe from dictionary and select elements

In [72]:
popularity = {"character":["spiderman", "superman", "ironman","tom","jerry"],
             "popularity":["first","second","third","fourth","fifth"],
             "score":[60,57,46,59,47]}
popularity

{'character': ['spiderman', 'superman', 'ironman', 'tom', 'jerry'],
 'popularity': ['first', 'second', 'third', 'fourth', 'fifth'],
 'score': [60, 57, 46, 59, 47]}

In [77]:
dataframe4 = pd.DataFrame(popularity, index = ['A','B','C','D','E'], columns = ['character','popularity','score'])
dataframe4

   character popularity  score
A  spiderman      first     60
B   superman     second     57
C    ironman      third     46
D        tom     fourth     59
E      jerry      fifth     47

In [81]:
#accessing the elements
dataframe4.iloc[2][0]

'ironman'

In [85]:
dataframe4.loc['C','character']

'ironman'

In [84]:
dataframe4.at['C','character']

'ironman'

In [86]:
dataframe4.iat[2,0]

'ironman'

In [87]:
dataframe4[:]

   character popularity  score
A  spiderman      first     60
B   superman     second     57
C    ironman      third     46
D        tom     fourth     59
E      jerry      fifth     47

In [88]:
dataframe4['score']

A    60
B    57
C    46
D    59
E    47
Name: score, dtype: int64

In [89]:
dataframe4['score']['C']

46

In [90]:
dataframe4['score'][2]

46

In [91]:
dataframe4[1:3]

  character popularity  score
B  superman     second     57
C   ironman      third     46

In [93]:
dataframe4[1:]

  character popularity  score
B  superman     second     57
C   ironman      third     46
D       tom     fourth     59
E     jerry      fifth     47

In [94]:
dataframe4[:3]

   character popularity  score
A  spiderman      first     60
B   superman     second     57
C    ironman      third     46